##################################################
# 問題 1:
# n 個の数値 a[0], a[1], ..., a[n-1] が与えられます。この n 個の数値の中に 0 が含まれるかどうかを判定してください。
##################################################

numbers = gets.chomp.split.map(&:to_i)

if numbers.find(0)
  puts "Yes"
else
  puts "No"
end

##################################################
# 問題 2:
# n 個の数値 a[0], a[1], ..., a[n-1] が与えられます。この n 個の数値のうち 0 は何個あるかを出力してください。
##################################################

numbers = gets.chomp.split.map(&:to_i)
puts numbers.find_all(0).count

##################################################
# 問題 3:
# n 個の数値 a[0], a[1], ..., a[n-1] が与えられます。この n 個の数値のうち最も小さいものを出力してください。
# 制約: 1 <= n <= 10,000, -10,000,000 <= a[i] <= 10,000,000
##################################################

numbers = gets.chomp.split.map(&:to_i)
min_value = 10000001

numbers.each do |number|
  min_value = number if min_value > number
end

puts min_value
